package lesson_6;

public class HM6 {
    public static void main(String[] args) {

//        1
//
//
//        Задача: Программа вводит строки, пока пользователь не введёт пустую строку (нажав enter).
//                Потом она конвертирует строки в верхний регистр (Мама превращается в МАМА) и выводит их на экран.
//
//
//                Новая задача: Программа вводит строки, пока пользователь не введёт пустую строку (нажав enter).
//                Если в строке чётное число букв, строка удваивается, если нечётное - утраивается.
//                Программа выводит слова на экран.





    }
}
